#ifndef CANARD_NET_OFP_V13_OPENFLOW_HPP
#define CANARD_NET_OFP_V13_OPENFLOW_HPP

#include <cstddef>
#include <cstdint>
#include <type_traits>

namespace canard {
namespace net {
namespace ofp {
namespace v13 {

  namespace v13_detail {

    struct ofp_header
    {
      std::uint8_t version;
      std::uint8_t type;
      std::uint16_t length;
      std::uint32_t xid;
    };
    static_assert(sizeof(ofp_header) == 8, "");

    struct ofp_hello_elem_header
    {
      std::uint16_t type;
      std::uint16_t length;
    };
    static_assert(sizeof(ofp_hello_elem_header) == 4, "");

    struct ofp_hello_elem_versionbitmap
    {
      std::uint16_t type;
      std::uint16_t length;
    };
    static_assert(sizeof(ofp_hello_elem_versionbitmap) == 4, "");

    struct ofp_hello
    {
      ofp_header header;
    };
    static_assert(sizeof(ofp_hello) == 8, "");

    struct ofp_switch_config
    {
      ofp_header header;
      std::uint16_t flags;
      std::uint16_t miss_send_len;
    };
    static_assert(sizeof(ofp_switch_config) == 12, "");

    struct ofp_table_mod
    {
      ofp_header header;
      std::uint8_t table_id;
      std::uint8_t pad[3];
      std::uint32_t config;
    };
    static_assert(sizeof(ofp_table_mod) == 16, "");

    struct ofp_port
    {
      std::uint32_t port_no;
      std::uint8_t pad[4];
      std::uint8_t hw_addr[6];
      std::uint8_t pad2[2];
      char name[16];
      std::uint32_t config;
      std::uint32_t state;
      std::uint32_t curr;
      std::uint32_t advertised;
      std::uint32_t supported;
      std::uint32_t peer;
      std::uint32_t curr_speed;
      std::uint32_t max_speed;
    };
    static_assert(sizeof(ofp_port) == 64, "");

    struct ofp_switch_features
    {
      ofp_header header;
      std::uint64_t datapath_id;
      std::uint32_t n_buffers;
      std::uint8_t n_tables;
      std::uint8_t auxiliary_id;
      std::uint8_t pad[2];
      std::uint32_t capabilities;
      std::uint32_t reserved;
    };
    static_assert(sizeof(ofp_switch_features) == 32, "");

    struct ofp_port_status
    {
      ofp_header header;
      std::uint8_t reason;
      std::uint8_t pad[7];
      ofp_port desc;
    };
    static_assert(sizeof(ofp_port_status) == 80, "");

    struct ofp_port_mod
    {
      ofp_header header;
      std::uint32_t port_no;
      std::uint8_t pad[4];
      std::uint8_t hw_addr[6];
      std::uint8_t pad2[2];
      std::uint32_t config;
      std::uint32_t mask;
      std::uint32_t advertise;
      std::uint8_t pad3[4];
    };
    static_assert(sizeof(ofp_port_mod) == 40, "");

    struct ofp_match
    {
      std::uint16_t type;
      std::uint16_t length;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_match) == 8, "");

    struct ofp_oxm_experimenter_header
    {
      std::uint32_t oxm_header;
      std::uint32_t experimenter;
    };
    static_assert(sizeof(ofp_oxm_experimenter_header) == 8, "");

    struct ofp_action_header
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_action_header) == 8, "");

    struct ofp_action_output
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t port;
      std::uint16_t max_len;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_action_output) == 16, "");

    struct ofp_action_mpls_ttl
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t mpls_ttl;
      std::uint8_t pad[3];
    };
    static_assert(sizeof(ofp_action_mpls_ttl) == 8, "");

    struct ofp_action_push
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint16_t ethertype;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_action_push) == 8, "");

    struct ofp_action_pop_mpls
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint16_t ethertype;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_action_pop_mpls) == 8, "");

    struct ofp_action_group
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t group_id;
    };
    static_assert(sizeof(ofp_action_group) == 8, "");

    struct ofp_action_nw_ttl
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t nw_ttl;
      std::uint8_t pad[3];
    };
    static_assert(sizeof(ofp_action_nw_ttl) == 8, "");

    struct ofp_action_set_field
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t field[4];
    };
    static_assert(sizeof(ofp_action_set_field) == 8, "");

    struct ofp_action_experimenter_header
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t experimenter;
    };
    static_assert(sizeof(ofp_action_experimenter_header) == 8, "");

    struct ofp_instruction
    {
      std::uint16_t type;
      std::uint16_t len;
    };
    static_assert(sizeof(ofp_instruction) == 4, "");

    struct ofp_instruction_goto_table
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t table_id;
      std::uint8_t pad[3];
    };
    static_assert(sizeof(ofp_instruction_goto_table) == 8, "");

    struct ofp_instruction_write_metadata
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t pad[4];
      std::uint64_t metadata;
      std::uint64_t metadata_mask;
    };
    static_assert(sizeof(ofp_instruction_write_metadata) == 24, "");

    struct ofp_instruction_actions
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_instruction_actions) == 8, "");

    struct ofp_instruction_meter
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t meter_id;
    };
    static_assert(sizeof(ofp_instruction_meter) == 8, "");

    struct ofp_instruction_experimenter
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t experimenter;
    };
    static_assert(sizeof(ofp_instruction_experimenter) == 8, "");

    struct ofp_flow_mod
    {
      ofp_header header;
      std::uint64_t cookie;
      std::uint64_t cookie_mask;
      std::uint8_t table_id;
      std::uint8_t command;
      std::uint16_t idle_timeout;
      std::uint16_t hard_timeout;
      std::uint16_t priority;
      std::uint32_t buffer_id;
      std::uint32_t out_port;
      std::uint32_t out_group;
      std::uint16_t flags;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_flow_mod) == 48, "");

    struct ofp_bucket
    {
      std::uint16_t len;
      std::uint16_t weight;
      std::uint32_t watch_port;
      std::uint32_t watch_group;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_bucket) == 16, "");

    struct ofp_group_mod
    {
      ofp_header header;
      std::uint16_t command;
      std::uint8_t type;
      std::uint8_t pad;
      std::uint32_t group_id;
    };
    static_assert(sizeof(ofp_group_mod) == 16, "");

    struct ofp_packet_out
    {
      ofp_header header;
      std::uint32_t buffer_id;
      std::uint32_t in_port;
      std::uint16_t actions_len;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_packet_out) == 24, "");

    struct ofp_packet_in
    {
      ofp_header header;
      std::uint32_t buffer_id;
      std::uint16_t total_len;
      std::uint8_t reason;
      std::uint8_t table_id;
      std::uint64_t cookie;
    };
    static_assert(sizeof(ofp_packet_in) == 24, "");

    struct ofp_flow_removed
    {
      ofp_header header;
      std::uint64_t cookie;
      std::uint16_t priority;
      std::uint8_t reason;
      std::uint8_t table_id;
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
      std::uint16_t idle_timeout;
      std::uint16_t hard_timeout;
      std::uint64_t packet_count;
      std::uint64_t byte_count;
    };
    static_assert(sizeof(ofp_flow_removed) == 48, "");

    struct ofp_meter_band_header
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t rate;
      std::uint32_t burst_size;
    };
    static_assert(sizeof(ofp_meter_band_header) == 12, "");

    struct ofp_meter_band_drop
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t rate;
      std::uint32_t burst_size;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_meter_band_drop) == 16, "");

    struct ofp_meter_band_dscp_remark
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t rate;
      std::uint32_t burst_size;
      std::uint8_t prec_level;
      std::uint8_t pad[3];
    };
    static_assert(sizeof(ofp_meter_band_dscp_remark) == 16, "");

    struct ofp_meter_band_experimenter
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t rate;
      std::uint32_t burst_size;
      std::uint32_t experimenter;
    };
    static_assert(sizeof(ofp_meter_band_experimenter) == 16, "");

    struct ofp_meter_mod
    {
      ofp_header header;
      std::uint16_t command;
      std::uint16_t flags;
      std::uint32_t meter_id;
    };
    static_assert(sizeof(ofp_meter_mod) == 16, "");

    struct ofp_error_msg
    {
      ofp_header header;
      std::uint16_t type;
      std::uint16_t code;
    };
    static_assert(sizeof(ofp_error_msg) == 12, "");

    struct ofp_error_experimenter_msg
    {
      ofp_header header;
      std::uint16_t type;
      std::uint16_t exp_type;
      std::uint32_t experimenter;
    };
    static_assert(sizeof(ofp_error_experimenter_msg) == 16, "");

    struct ofp_multipart_request
    {
      ofp_header header;
      std::uint16_t type;
      std::uint16_t flags;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_multipart_request) == 16, "");

    struct ofp_multipart_reply
    {
      ofp_header header;
      std::uint16_t type;
      std::uint16_t flags;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_multipart_reply) == 16, "");

    struct ofp_desc
    {
      char mfr_desc[256];
      char hw_desc[256];
      char sw_desc[256];
      char serial_num[32];
      char dp_desc[256];
    };
    static_assert(sizeof(ofp_desc) == 1056, "");

    struct ofp_flow_stats_request
    {
      std::uint8_t table_id;
      std::uint8_t pad[3];
      std::uint32_t out_port;
      std::uint32_t out_group;
      std::uint8_t pad2[4];
      std::uint64_t cookie;
      std::uint64_t cookie_mask;
    };
    static_assert(sizeof(ofp_flow_stats_request) == 32, "");

    struct ofp_flow_stats
    {
      std::uint16_t length;
      std::uint8_t table_id;
      std::uint8_t pad;
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
      std::uint16_t priority;
      std::uint16_t idle_timeout;
      std::uint16_t hard_timeout;
      std::uint16_t flags;
      std::uint8_t pad2[4];
      std::uint64_t cookie;
      std::uint64_t packet_count;
      std::uint64_t byte_count;
    };
    static_assert(sizeof(ofp_flow_stats) == 48, "");

    struct ofp_aggregate_stats_request
    {
      std::uint8_t table_id;
      std::uint8_t pad[3];
      std::uint32_t out_port;
      std::uint32_t out_group;
      std::uint8_t pad2[4];
      std::uint64_t cookie;
      std::uint64_t cookie_mask;
    };
    static_assert(sizeof(ofp_aggregate_stats_request) == 32, "");

    struct ofp_aggregate_stats_reply
    {
      std::uint64_t packet_count;
      std::uint64_t byte_count;
      std::uint32_t flow_count;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_aggregate_stats_reply) == 24, "");

    struct ofp_table_feature_prop_header
    {
      std::uint16_t type;
      std::uint16_t length;
    };
    static_assert(sizeof(ofp_table_feature_prop_header) == 4, "");

    struct ofp_table_feature_prop_instructions
    {
      std::uint16_t type;
      std::uint16_t length;
    };
    static_assert(sizeof(ofp_table_feature_prop_instructions) == 4, "");

    struct ofp_table_feature_prop_next_tables
    {
      std::uint16_t type;
      std::uint16_t length;
    };
    static_assert(sizeof(ofp_table_feature_prop_next_tables) == 4, "");

    struct ofp_table_feature_prop_actions
    {
      std::uint16_t type;
      std::uint16_t length;
    };
    static_assert(sizeof(ofp_table_feature_prop_actions) == 4, "");

    struct ofp_table_feature_prop_oxm
    {
      std::uint16_t type;
      std::uint16_t length;
    };
    static_assert(sizeof(ofp_table_feature_prop_oxm) == 4, "");

    struct ofp_table_feature_prop_experimenter
    {
      std::uint16_t type;
      std::uint16_t length;
      std::uint32_t experimenter;
      std::uint32_t exp_type;
    };
    static_assert(sizeof(ofp_table_feature_prop_experimenter) == 12, "");

    struct ofp_table_features
    {
      std::uint16_t length;
      std::uint8_t table_id;
      std::uint8_t pad[5];
      char name[32];
      std::uint64_t metadata_match;
      std::uint64_t metadata_write;
      std::uint32_t config;
      std::uint32_t max_entries;
    };
    static_assert(sizeof(ofp_table_features) == 64, "");

    struct ofp_table_stats
    {
      std::uint8_t table_id;
      std::uint8_t pad[3];
      std::uint32_t active_count;
      std::uint64_t lookup_count;
      std::uint64_t matched_count;
    };
    static_assert(sizeof(ofp_table_stats) == 24, "");

    struct ofp_port_stats_request
    {
      std::uint32_t port_no;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_port_stats_request) == 8, "");

    struct ofp_port_stats
    {
      std::uint32_t port_no;
      std::uint8_t pad[4];
      std::uint64_t rx_packets;
      std::uint64_t tx_packets;
      std::uint64_t rx_bytes;
      std::uint64_t tx_bytes;
      std::uint64_t rx_dropped;
      std::uint64_t tx_dropped;
      std::uint64_t rx_errors;
      std::uint64_t tx_errors;
      std::uint64_t rx_frame_err;
      std::uint64_t rx_over_err;
      std::uint64_t rx_crc_err;
      std::uint64_t collisions;
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
    };
    static_assert(sizeof(ofp_port_stats) == 112, "");

    struct ofp_group_stats_request
    {
      std::uint32_t group_id;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_group_stats_request) == 8, "");

    struct ofp_bucket_counter
    {
      std::uint64_t packet_count;
      std::uint64_t byte_count;
    };
    static_assert(sizeof(ofp_bucket_counter) == 16, "");

    struct ofp_group_stats
    {
      std::uint16_t length;
      std::uint8_t pad[2];
      std::uint32_t group_id;
      std::uint32_t ref_count;
      std::uint8_t pad2[4];
      std::uint64_t packet_count;
      std::uint64_t byte_count;
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
    };
    static_assert(sizeof(ofp_group_stats) == 40, "");

    struct ofp_group_desc
    {
      std::uint16_t length;
      std::uint8_t type;
      std::uint8_t pad;
      std::uint32_t group_id;
    };
    static_assert(sizeof(ofp_group_desc) == 8, "");

    struct ofp_group_features
    {
      std::uint32_t types;
      std::uint32_t capabilities;
      std::uint32_t max_groups[4];
      std::uint32_t actions[4];
    };
    static_assert(sizeof(ofp_group_features) == 40, "");

    struct ofp_meter_multipart_request
    {
      std::uint32_t meter_id;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_meter_multipart_request) == 8, "");

    struct ofp_meter_band_stats
    {
      std::uint64_t packet_band_count;
      std::uint64_t byte_band_count;
    };
    static_assert(sizeof(ofp_meter_band_stats) == 16, "");

    struct ofp_meter_stats
    {
      std::uint32_t meter_id;
      std::uint16_t len;
      std::uint8_t pad[6];
      std::uint32_t flow_count;
      std::uint64_t packet_in_count;
      std::uint64_t byte_in_count;
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
    };
    static_assert(sizeof(ofp_meter_stats) == 40, "");

    struct ofp_meter_config
    {
      std::uint16_t length;
      std::uint16_t flags;
      std::uint32_t meter_id;
    };
    static_assert(sizeof(ofp_meter_config) == 8, "");

    struct ofp_meter_features
    {
      std::uint32_t max_meter;
      std::uint32_t band_types;
      std::uint32_t capabilities;
      std::uint8_t max_bands;
      std::uint8_t max_color;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_meter_features) == 16, "");

    struct ofp_experimenter_multipart_header
    {
      std::uint32_t experimenter;
      std::uint32_t exp_type;
    };
    static_assert(sizeof(ofp_experimenter_multipart_header) == 8, "");

    struct ofp_experimenter_header
    {
      ofp_header header;
      std::uint32_t experimenter;
      std::uint32_t exp_type;
    };
    static_assert(sizeof(ofp_experimenter_header) == 16, "");

    struct ofp_queue_prop_header
    {
      std::uint16_t property;
      std::uint16_t len;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_queue_prop_header) == 8, "");

    struct ofp_queue_prop_min_rate
    {
      ofp_queue_prop_header prop_header;
      std::uint16_t rate;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_queue_prop_min_rate) == 16, "");

    struct ofp_queue_prop_max_rate
    {
      ofp_queue_prop_header prop_header;
      std::uint16_t rate;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_queue_prop_max_rate) == 16, "");

    struct ofp_queue_prop_experimenter
    {
      ofp_queue_prop_header prop_header;
      std::uint32_t experimenter;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_queue_prop_experimenter) == 16, "");

    struct ofp_packet_queue
    {
      std::uint32_t queue_id;
      std::uint32_t port;
      std::uint16_t len;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_packet_queue) == 16, "");

    struct ofp_queue_get_config_request
    {
      ofp_header header;
      std::uint32_t port;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_queue_get_config_request) == 16, "");

    struct ofp_queue_get_config_reply
    {
      ofp_header header;
      std::uint32_t port;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_queue_get_config_reply) == 16, "");

    struct ofp_action_set_queue
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t queue_id;
    };
    static_assert(sizeof(ofp_action_set_queue) == 8, "");

    struct ofp_queue_stats_request
    {
      std::uint32_t port_no;
      std::uint32_t queue_id;
    };
    static_assert(sizeof(ofp_queue_stats_request) == 8, "");

    struct ofp_queue_stats
    {
      std::uint32_t port_no;
      std::uint32_t queue_id;
      std::uint64_t tx_bytes;
      std::uint64_t tx_packets;
      std::uint64_t tx_errors;
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
    };
    static_assert(sizeof(ofp_queue_stats) == 40, "");

    struct ofp_role_request
    {
      ofp_header header;
      std::uint32_t role;
      std::uint8_t pad[4];
      std::uint64_t generation_id;
    };
    static_assert(sizeof(ofp_role_request) == 24, "");

    struct ofp_async_config
    {
      ofp_header header;
      std::uint32_t packet_in_mask[2];
      std::uint32_t port_status_mask[2];
      std::uint32_t flow_removed_mask[2];
    };
    static_assert(sizeof(ofp_async_config) == 32, "");

  } // namespace v13_detail

  namespace protocol {

    enum uint8_t_constants : std::uint8_t
    {
      OFP_VERSION = 0x04,
    };

    enum uint16_t_constants : std::uint16_t
    {
      OFP_TCP_PORT = 6653,
      OFP_SSL_PORT = 6653,
      OFP_DEFAULT_MISS_SEND_LEN = 128,
      OFP_FLOW_PERMANENT = 0,
      OFP_DEFAULT_PRIORITY = 0x8000,
      OFPQ_MIN_RATE_UNCFG = 0xffff,
      OFPQ_MAX_RATE_UNCFG = 0xffff,
    };

    enum uint32_t_constants : std::uint32_t
    {
      OFP_NO_BUFFER = 0xffffffff,
      OFPQ_ALL = 0xffffffff,
    };

    enum ofp_port_no
    {
      OFPP_MAX = 4294967040,
      OFPP_IN_PORT = 4294967288,
      OFPP_TABLE = 4294967289,
      OFPP_NORMAL = 4294967290,
      OFPP_FLOOD = 4294967291,
      OFPP_ALL = 4294967292,
      OFPP_CONTROLLER = 4294967293,
      OFPP_LOCAL = 4294967294,
      OFPP_ANY = 4294967295,
    };

    enum ofp_type
    {
      OFPT_HELLO = 0,
      OFPT_ERROR = 1,
