#ifndef CANARD_NET_OFP_V10_OPENFLOW_HPP
#define CANARD_NET_OFP_V10_OPENFLOW_HPP

#include <cstddef>
#include <cstdint>
#include <type_traits>

namespace canard {
namespace net {
namespace ofp {
namespace v10 {

  namespace v10_detail {

    struct ofp_header
    {
      std::uint8_t version;
      std::uint8_t type;
      std::uint16_t length;
      std::uint32_t xid;
    };
    static_assert(sizeof(ofp_header) == 8, "");

    struct ofp_hello
    {
      ofp_header header;
    };
    static_assert(sizeof(ofp_hello) == 8, "");

    struct ofp_switch_config
    {
      ofp_header header;
      std::uint16_t flags;
      std::uint16_t miss_send_len;
    };
    static_assert(sizeof(ofp_switch_config) == 12, "");

    struct ofp_phy_port
    {
      std::uint16_t port_no;
      std::uint8_t hw_addr[6];
      char name[16];
      std::uint32_t config;
      std::uint32_t state;
      std::uint32_t curr;
      std::uint32_t advertised;
      std::uint32_t supported;
      std::uint32_t peer;
    };
    static_assert(sizeof(ofp_phy_port) == 48, "");

    struct ofp_switch_features
    {
      ofp_header header;
      std::uint64_t datapath_id;
      std::uint32_t n_buffers;
      std::uint8_t n_tables;
      std::uint8_t pad[3];
      std::uint32_t capabilities;
      std::uint32_t actions;
    };
    static_assert(sizeof(ofp_switch_features) == 32, "");

    struct ofp_port_status
    {
      ofp_header header;
      std::uint8_t reason;
      std::uint8_t pad[7];
      ofp_phy_port desc;
    };
    static_assert(sizeof(ofp_port_status) == 64, "");

    struct ofp_port_mod
    {
      ofp_header header;
      std::uint16_t port_no;
      std::uint8_t hw_addr[6];
      std::uint32_t config;
      std::uint32_t mask;
      std::uint32_t advertise;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_port_mod) == 32, "");

    struct ofp_packet_in
    {
      ofp_header header;
      std::uint32_t buffer_id;
      std::uint16_t total_len;
      std::uint16_t in_port;
      std::uint8_t reason;
      std::uint8_t pad;
    };
    static_assert(sizeof(ofp_packet_in) == 20, "");

    struct ofp_action_output
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint16_t port;
      std::uint16_t max_len;
    };
    static_assert(sizeof(ofp_action_output) == 8, "");

    struct ofp_action_vlan_vid
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint16_t vlan_vid;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_action_vlan_vid) == 8, "");

    struct ofp_action_vlan_pcp
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t vlan_pcp;
      std::uint8_t pad[3];
    };
    static_assert(sizeof(ofp_action_vlan_pcp) == 8, "");

    struct ofp_action_dl_addr
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t dl_addr[6];
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_action_dl_addr) == 16, "");

    struct ofp_action_nw_addr
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t nw_addr;
    };
    static_assert(sizeof(ofp_action_nw_addr) == 8, "");

    struct ofp_action_tp_port
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint16_t tp_port;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_action_tp_port) == 8, "");

    struct ofp_action_nw_tos
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t nw_tos;
      std::uint8_t pad[3];
    };
    static_assert(sizeof(ofp_action_nw_tos) == 8, "");

    struct ofp_action_vendor_header
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint32_t vendor;
    };
    static_assert(sizeof(ofp_action_vendor_header) == 8, "");

    struct ofp_action_header
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_action_header) == 8, "");

    struct ofp_packet_out
    {
      ofp_header header;
      std::uint32_t buffer_id;
      std::uint16_t in_port;
      std::uint16_t actions_len;
    };
    static_assert(sizeof(ofp_packet_out) == 16, "");

    struct ofp_match
    {
      std::uint32_t wildcards;
      std::uint16_t in_port;
      std::uint8_t dl_src[6];
      std::uint8_t dl_dst[6];
      std::uint16_t dl_vlan;
      std::uint8_t dl_vlan_pcp;
      std::uint8_t pad1[1];
      std::uint16_t dl_type;
      std::uint8_t nw_tos;
      std::uint8_t nw_proto;
      std::uint8_t pad2[2];
      std::uint32_t nw_src;
      std::uint32_t nw_dst;
      std::uint16_t tp_src;
      std::uint16_t tp_dst;
    };
    static_assert(sizeof(ofp_match) == 40, "");

    struct ofp_flow_mod
    {
      ofp_header header;
      ofp_match match;
      std::uint64_t cookie;
      std::uint16_t command;
      std::uint16_t idle_timeout;
      std::uint16_t hard_timeout;
      std::uint16_t priority;
      std::uint32_t buffer_id;
      std::uint16_t out_port;
      std::uint16_t flags;
    };
    static_assert(sizeof(ofp_flow_mod) == 72, "");

    struct ofp_flow_removed
    {
      ofp_header header;
      ofp_match match;
      std::uint64_t cookie;
      std::uint16_t priority;
      std::uint8_t reason;
      std::uint8_t pad[1];
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
      std::uint16_t idle_timeout;
      std::uint8_t pad2[2];
      std::uint64_t packet_count;
      std::uint64_t byte_count;
    };
    static_assert(sizeof(ofp_flow_removed) == 88, "");

    struct ofp_error_msg
    {
      ofp_header header;
      std::uint16_t type;
      std::uint16_t code;
    };
    static_assert(sizeof(ofp_error_msg) == 12, "");

    struct ofp_stats_request
    {
      ofp_header header;
      std::uint16_t type;
      std::uint16_t flags;
    };
    static_assert(sizeof(ofp_stats_request) == 12, "");

    struct ofp_stats_reply
    {
      ofp_header header;
      std::uint16_t type;
      std::uint16_t flags;
    };
    static_assert(sizeof(ofp_stats_reply) == 12, "");

    struct ofp_desc_stats
    {
      char mfr_desc[256];
      char hw_desc[256];
      char sw_desc[256];
      char serial_num[32];
      char dp_desc[256];
    };
    static_assert(sizeof(ofp_desc_stats) == 1056, "");

    struct ofp_flow_stats_request
    {
      ofp_match match;
      std::uint8_t table_id;
      std::uint8_t pad;
      std::uint16_t out_port;
    };
    static_assert(sizeof(ofp_flow_stats_request) == 44, "");

    struct ofp_flow_stats
    {
      std::uint16_t length;
      std::uint8_t table_id;
      std::uint8_t pad;
      ofp_match match;
      std::uint32_t duration_sec;
      std::uint32_t duration_nsec;
      std::uint16_t priority;
      std::uint16_t idle_timeout;
      std::uint16_t hard_timeout;
      std::uint8_t pad2[6];
      std::uint64_t cookie;
      std::uint64_t packet_count;
      std::uint64_t byte_count;
    };
    static_assert(sizeof(ofp_flow_stats) == 88, "");

    struct ofp_aggregate_stats_request
    {
      ofp_match match;
      std::uint8_t table_id;
      std::uint8_t pad;
      std::uint16_t out_port;
    };
    static_assert(sizeof(ofp_aggregate_stats_request) == 44, "");

    struct ofp_aggregate_stats_reply
    {
      std::uint64_t packet_count;
      std::uint64_t byte_count;
      std::uint32_t flow_count;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_aggregate_stats_reply) == 24, "");

    struct ofp_table_stats
    {
      std::uint8_t table_id;
      std::uint8_t pad[3];
      char name[32];
      std::uint32_t wildcards;
      std::uint32_t max_entries;
      std::uint32_t active_count;
      std::uint64_t lookup_count;
      std::uint64_t matched_count;
    };
    static_assert(sizeof(ofp_table_stats) == 64, "");

    struct ofp_port_stats_request
    {
      std::uint16_t port_no;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_port_stats_request) == 8, "");

    struct ofp_port_stats
    {
      std::uint16_t port_no;
      std::uint8_t pad[6];
      std::uint64_t rx_packets;
      std::uint64_t tx_packets;
      std::uint64_t rx_bytes;
      std::uint64_t tx_bytes;
      std::uint64_t rx_dropped;
      std::uint64_t tx_dropped;
      std::uint64_t rx_errors;
      std::uint64_t tx_errors;
      std::uint64_t rx_frame_err;
      std::uint64_t rx_over_err;
      std::uint64_t rx_crc_err;
      std::uint64_t collisions;
    };
    static_assert(sizeof(ofp_port_stats) == 104, "");

    struct ofp_vendor_header
    {
      ofp_header header;
      std::uint32_t vendor;
    };
    static_assert(sizeof(ofp_vendor_header) == 12, "");

    struct ofp_queue_prop_header
    {
      std::uint16_t property;
      std::uint16_t len;
      std::uint8_t pad[4];
    };
    static_assert(sizeof(ofp_queue_prop_header) == 8, "");

    struct ofp_queue_prop_min_rate
    {
      ofp_queue_prop_header prop_header;
      std::uint16_t rate;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_queue_prop_min_rate) == 16, "");

    struct ofp_packet_queue
    {
      std::uint32_t queue_id;
      std::uint16_t len;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_packet_queue) == 8, "");

    struct ofp_queue_get_config_request
    {
      ofp_header header;
      std::uint16_t port;
      std::uint8_t pad[2];
    };
    static_assert(sizeof(ofp_queue_get_config_request) == 12, "");

    struct ofp_queue_get_config_reply
    {
      ofp_header header;
      std::uint16_t port;
      std::uint8_t pad[6];
    };
    static_assert(sizeof(ofp_queue_get_config_reply) == 16, "");

    struct ofp_action_enqueue
    {
      std::uint16_t type;
      std::uint16_t len;
      std::uint16_t port;
      std::uint8_t pad[6];
      std::uint32_t queue_id;
    };
    static_assert(sizeof(ofp_action_enqueue) == 16, "");

    struct ofp_queue_stats_request
    {
      std::uint16_t port_no;
      std::uint8_t pad[2];
      std::uint32_t queue_id;
    };
    static_assert(sizeof(ofp_queue_stats_request) == 8, "");

    struct ofp_queue_stats
    {
      std::uint16_t port_no;
      std::uint8_t pad[2];
      std::uint32_t queue_id;
      std::uint64_t tx_bytes;
      std::uint64_t tx_packets;
      std::uint64_t tx_errors;
    };
    static_assert(sizeof(ofp_queue_stats) == 32, "");

  } // namespace v10_detail

  namespace protocol {

    enum uint8_t_constants : std::uint8_t
    {
      OFP_VERSION = 0x01,
    };

    enum uint16_t_constants : std::uint16_t
    {
      OFP_TCP_PORT = 6633,
      OFP_SSL_PORT = 6633,
      OFP_DEFAULT_MISS_SEND_LEN = 128,
      OFP_VLAN_NONE = 0xffff,
      OFP_DL_TYPE_ETH2_CUTOFF = 0x0600,
      OFP_DL_TYPE_NOT_ETH_TYPE = 0x05ff,
      OFP_FLOW_PERMANENT = 0,
      OFP_DEFAULT_PRIORITY = 0x8000,
      OFPQ_MIN_RATE_UNCFG = 0xffff,
    };

    enum uint32_t_constants : std::uint32_t
    {
      OFP_NO_BUFFER = 0xffffffff,
      OFPQ_ALL = 0xffffffff,
    };

    enum size_t_constants : std::size_t
    {
      OFP_MAX_TABLE_NAME_LEN = 32,
      OFP_MAX_PORT_NAME_LEN = 16,
      OFP_ETH_ALEN = 6,
      DESC_STR_LEN = 256,
      SERIAL_NUM_LEN = 32,
    };

    enum ofp_port
    {
      OFPP_MAX = 65280,
      OFPP_IN_PORT = 65528,
      OFPP_TABLE = 65529,
      OFPP_NORMAL = 65530,
